micropython/micropython/ports/esp32/machine_pwm.c
// This called from Ctrl-D soft reboot
void machine_pwm_deinit_all(void) {
    if (pwm_inited) {
        for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
            for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
                pwm_deinit(mode, channel, 0);
            }
        }
        pwm_inited = false;
    }
}

static void pwm_is_active(machine_pwm_obj_t *self) {
    if (self->timer < 0) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("PWM is inactive"));
    }
}

// Calculate the duty parameters based on an ns value
static int ns_to_duty(machine_pwm_obj_t *self, int ns) {
    pwm_is_active(self);
    int64_t duty = ((int64_t)ns * (int64_t)MAX_16_DUTY * self->freq + 500000000LL) / 1000000000LL;
    if ((ns > 0) && (duty == 0)) {
        duty = 1;
    } else if (duty > MAX_16_DUTY) {
        duty = MAX_16_DUTY;
    }
    return duty;
}

static int duty_to_ns(machine_pwm_obj_t *self, int duty) {
    pwm_is_active(self);
    return ((int64_t)duty * 1000000000LL + (int64_t)self->freq * (int64_t)(MAX_16_DUTY / 2)) / ((int64_t)self->freq * (int64_t)MAX_16_DUTY);
}

// Reconfigure PWM pin output as input/output. This allows to read the pin level.
static void reconfigure_pin(machine_pwm_obj_t *self) {
    bool invert = self->output_invert;
    if (self->channel_duty == MAX_timer_duty) {
        invert = !invert;
    }
    #if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 4, 0)
    gpio_set_direction(self->pin, GPIO_MODE_INPUT_OUTPUT);
    #endif
    esp_rom_gpio_connect_out_signal(self->pin, ledc_periph_signal[self->mode].sig_out0_idx + self->channel, invert, 0);
}

static void apply_duty(machine_pwm_obj_t *self) {
    pwm_is_active(self);

    int duty = 0;
    if (self->duty_scale == DUTY_16) {
        duty = self->duty_ui;
    } else if (self->duty_scale == DUTY_10) {
        duty = self->duty_ui == MAX_10_DUTY ? MAX_16_DUTY : self->duty_ui << (UI_RES_16_BIT - UI_RES_10_BIT);
    } else if (self->duty_scale == DUTY_NS) {
        duty = ns_to_duty(self, self->duty_ui);
    }
    self->channel_duty = duty >> (UI_RES_16_BIT - timers[self->mode][self->timer].duty_resolution);
    int max_timer_duty = MAX_timer_duty;
    if ((chans[self->mode][self->channel].pin == -1) || (self->channel_duty == 0) || (self->channel_duty == max_timer_duty) || (self->output_invert_prev != self->output_invert) || (self->output_is_inverted != self->output_invert)) {
        self->output_invert_prev = self->output_invert;
        // New PWM assignment
        ledc_channel_config_t cfg = {
            .channel = self->channel,
            .duty = self->channel_duty,
            .gpio_num = self->pin,
            .intr_type = LEDC_INTR_DISABLE,
            .speed_mode = self->mode,
            .timer_sel = self->timer,
            .hpoint = 0,
            .flags.output_invert = self->output_invert,
        };
        self->output_is_inverted = false;
        if (self->channel_duty == max_timer_duty) {
            cfg.duty = 0;
            cfg.flags.output_invert = !self->output_invert;
            self->output_is_inverted = true;
        }
        check_esp_err(ledc_channel_config(&cfg));
        if (self->light_sleep_enable) {
            // Disable SLP_SEL to change GPIO status automantically in lightsleep.
            check_esp_err(gpio_sleep_sel_dis(self->pin));
            chans[self->mode][self->channel].light_sleep_enable = true;
        }
    } else {
        #if FADE
        check_esp_err(ledc_set_duty_and_update(self->mode, self->channel, self->channel_duty, 0));
        #else
        check_esp_err(ledc_set_duty(self->mode, self->channel, self->channel_duty));
        check_esp_err(ledc_update_duty(self->mode, self->channel));
        #endif
    }
    reconfigure_pin(self);
    register_channel(self->mode, self->channel, self->pin, self->timer);
}

static uint32_t find_suitable_duty_resolution(uint32_t src_clk_freq, uint32_t timer_freq) {
    unsigned int resolution = ledc_find_suitable_duty_resolution(src_clk_freq, timer_freq);
    if (resolution > UI_RES_16_BIT) {
        // limit resolution to user interface
        resolution = UI_RES_16_BIT;
    }
    /*
    // Uncomment if duty is 65536!
    // Note: On ESP32, ESP32S2, ESP32S3, ESP32C3, ESP32C2, ESP32C6, ESP32H2, ESP32P4, due to a hardware bug,
    //       100% duty cycle (i.e. 2**duty_res) is not reachable when the binded timer selects the maximum duty
    //       resolution. For example, the max duty resolution on ESP32C3 is 14-bit width, then set duty to (2**14)
    //       will mess up the duty calculation in hardware.
    if (resolution >= SOC_LEDC_TIMER_BIT_WIDTH)
        resolution -= 1;
    }
    */
    return resolution;
}

static uint32_t get_duty_u16(machine_pwm_obj_t *self) {
    pwm_is_active(self);
    if (self->channel_duty == MAX_timer_duty) {
        return MAX_16_DUTY;
    } else {
        return ledc_get_duty(self->mode, self->channel) << (UI_RES_16_BIT - timers[self->mode][self->timer].duty_resolution);
    }
}

static uint32_t get_duty_u10(machine_pwm_obj_t *self) {
    // Scale down from 16 bit to 10 bit resolution
    return get_duty_u16(self) >> (UI_RES_16_BIT - UI_RES_10_BIT);
}

static uint32_t get_duty_ns(machine_pwm_obj_t *self) {
    return duty_to_ns(self, get_duty_u16(self));
}

static void check_duty_u16(machine_pwm_obj_t *self, int duty) {
    if ((duty < 0) || (duty > MAX_16_DUTY)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty_u16 must be from 0 to %d"), MAX_16_DUTY);
    }
    self->duty_scale = DUTY_16;
    self->duty_ui = duty;
}

static void set_duty_u16(machine_pwm_obj_t *self, int duty) {
    check_duty_u16(self, duty);
    apply_duty(self);
}

static void check_duty_u10(machine_pwm_obj_t *self, int duty) {
    if ((duty < 0) || (duty > MAX_10_DUTY)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty must be from 0 to %u"), MAX_10_DUTY);
    }
    self->duty_scale = DUTY_10;
    self->duty_ui = duty;
}

static void set_duty_u10(machine_pwm_obj_t *self, int duty) {
    check_duty_u10(self, duty);
    apply_duty(self);
}

